## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_docdb_cluster.ai-answers-docdb-cluster`              |
|        | `aws_docdb_cluster_instance.ai-answers-docdb-instance[0]` |
|        | `aws_docdb_subnet_group.ai-answers-docdb-subnet-group`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m22:57:33.648[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m22:57:33.648[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m22:57:33.648[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_docdb_cluster.ai-answers-docdb-cluster will be created
[0;90m22:57:33.648[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_docdb_cluster" "ai-answers-docdb-cluster" {
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + apply_immediately               = true
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                             = (known after apply)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zones              = (known after apply)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + backup_retention_period         = 1
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cluster_identifier              = "ai-answers-docdb-cluster"
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cluster_identifier_prefix       = (known after apply)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cluster_members                 = (known after apply)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cluster_resource_id             = (known after apply)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + db_cluster_parameter_group_name = "ai-asnwers-docdb-cluster-parameter-group"
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + db_subnet_group_name            = "ai-answers-example-docdb-subnet-group"
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + endpoint                        = (known after apply)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + engine                          = "docdb"
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + engine_version                  = "5.0.0"
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + hosted_zone_id                  = (known after apply)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                              = (known after apply)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + kms_key_id                      = (known after apply)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + master_password                 = (sensitive value)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + master_username                 = (sensitive value)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + port                            = 27017
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + preferred_backup_window         = (known after apply)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + preferred_maintenance_window    = (known after apply)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + reader_endpoint                 = (known after apply)
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + skip_final_snapshot             = true
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + storage_encrypted               = true
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                            = {
[0;90m22:57:33.649[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                        = {
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_security_group_ids          = [
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "sg-04966047bf236b850",
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_docdb_cluster_instance.ai-answers-docdb-instance[0] will be created
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_docdb_cluster_instance" "ai-answers-docdb-instance" {
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + apply_immediately               = true
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                             = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + auto_minor_version_upgrade      = true
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + availability_zone               = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ca_cert_identifier              = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + cluster_identifier              = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + db_subnet_group_name            = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + dbi_resource_id                 = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + endpoint                        = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + engine                          = "docdb"
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + engine_version                  = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                              = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + identifier                      = "ai-answers-docdb-instance"
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + identifier_prefix               = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + instance_class                  = "db.t3.medium"
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + kms_key_id                      = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + performance_insights_kms_key_id = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + port                            = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + preferred_backup_window         = (known after apply)
[0;90m22:57:33.650[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + preferred_maintenance_window    = (known after apply)
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + promotion_tier                  = 0
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + publicly_accessible             = (known after apply)
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + storage_encrypted               = (known after apply)
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                            = {
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                        = {
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + writer                          = (known after apply)
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_docdb_subnet_group.ai-answers-docdb-subnet-group will be created
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_docdb_subnet_group" "ai-answers-docdb-subnet-group" {
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn         = (known after apply)
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description = "Subnet group for DocumentDB for the AI Answers app"
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id          = (known after apply)
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name        = "ai-answers-example-docdb-subnet-group"
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix = (known after apply)
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + subnet_ids  = [
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "subnet-03d2b39863e8cb577",
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags        = {
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all    = {
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 3 to add, 0 to change, 0 to destroy.
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + aws_docdb_cluster_arn = (known after apply)
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + aws_docdb_cluster_id  = (known after apply)
[0;90m22:57:33.651[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m22:57:33.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0mSaved the plan to: plan.tfplan
[0;90m22:57:33.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTo perform exactly these actions, run the following command to apply:
[0;90m22:57:33.652[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
